src/Documents/КАЗ_ЗаявкаНаОплату/КАЗ_ЗаявкаНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ЗаявкаНаОплату</name>
  <registerRecords>AccumulationRegister.КАЗ_ПлановыеПлатежи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.КАЗ_ПриоритетыПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.КАЗ_СтатусыЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьОплаты</name>
    <type>
      <types>CatalogRef.КАЗ_ОчередиПлатежей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ЛимитыПлатежей/КАЗ_ЛимитыПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ЛимитыПлатежей</name>
  <resources>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/КАЗ_ПлановыеПлатежи/КАЗ_ПлановыеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ПлановыеПлатежи</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/КАЗ_ЗаявкаНаОплату/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Сообщить("Не заполнен контрагент.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтатьяПлатежа) Тогда
		Сообщить("Не заполнена статья платежа.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЦФО) Тогда
		Сообщить("Не заполнен центр финансовой ответственности.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если СуммаДокумента <= 0 Тогда
		Сообщить("Сумма заявки должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Получаем установленный лимит
ЗапросЛимита = Новый Запрос;
ЗапросЛимита.Текст =
"ВЫБРАТЬ
|	ЕСТЬNULL(ЛимитыОстатки.ЛимитОстаток, 0) КАК Лимит
|ИЗ
|	РегистрНакопления.КАЗ_ЛимитыПлатежей.Остатки(&Дата, ЦФО = &ЦФО И СтатьяПлатежа = &СтатьяПлатежа) КАК ЛимитыОстатки";

ЗапросЛимита.УстановитьПараметр("Дата", Дата);
ЗапросЛимита.УстановитьПараметр("ЦФО", ЦФО);
ЗапросЛимита.УстановитьПараметр("СтатьяПлатежа", СтатьяПлатежа);

РезультатЛимита = ЗапросЛимита.Выполнить().Выбрать();

Лимит = 0;
Если РезультатЛимита.Следующий() Тогда
	Лимит = РезультатЛимита.Лимит;
КонецЕсли;


// Получаем уже использованную сумму по проведенным заявкам
ЗапросИспользовано = Новый Запрос;
ЗапросИспользовано.Текст =
"ВЫБРАТЬ
|	ЕСТЬNULL(СУММА(ПлановыеПлатежиОбороты.СуммаОборот), 0) КАК Использовано
|ИЗ
|	РегистрНакопления.КАЗ_ПлановыеПлатежи.Обороты(, &Дата, , ЦФО = &ЦФО И СтатьяПлатежа = &СтатьяПлатежа) КАК ПлановыеПлатежиОбороты
|ГДЕ
|	ПлановыеПлатежиОбороты.Заявка <> &ТекущаяЗаявка";

ЗапросИспользовано.УстановитьПараметр("Дата", Дата);
ЗапросИспользовано.УстановитьПараметр("ЦФО", ЦФО);
ЗапросИспользовано.УстановитьПараметр("СтатьяПлатежа", СтатьяПлатежа);
ЗапросИспользовано.УстановитьПараметр("ТекущаяЗаявка", Ссылка);

РезультатИспользовано = ЗапросИспользовано.Выполнить().Выбрать();

Использовано = 0;
Если РезультатИспользовано.Следующий() Тогда
	Использовано = РезультатИспользовано.Использовано;
КонецЕсли;

Доступно = Лимит - Использовано;

Если Доступно < СуммаДокумента Тогда

	Сообщить("Недостаточно лимита для проведения заявки. Доступно: "
		+ Формат(Доступно, "ЧДЦ=2")
		+ ", требуется: "
		+ Формат(СуммаДокумента, "ЧДЦ=2"));

	Отказ = Истина;
	Возврат;

КонецЕсли;
	Движения.КАЗ_ПлановыеПлатежи.Записывать = Истина;

	Движение = Движения.КАЗ_ПлановыеПлатежи.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заявка = Ссылка;
	Движение.Контрагент = Контрагент;
	Движение.СтатьяПлатежа = СтатьяПлатежа;
	Движение.ЦФО = ЦФО;
	Движение.Сумма = СуммаДокумента;

КонецПроцедуры
